; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-3 - location
	p1-0 - location
	p1-4 - location
	p2-5 - location
	p2-9 - location
	p3-4 - location
	p3-9 - location
	p5-7 - location
	p6-0 - location
	p6-1 - location
	p6-3 - location
	p6-8 - location
	p7-4 - location
	p9-4 - location
	p9-6 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s2)
	(at driver3 s4)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s8)
	(at package2 s3)
	(at package3 s7)
	(at package4 s7)
	(at package5 s8)
	(at package6 s7)
	(at package7 s8)
	(at package8 s6)
	(at package9 s3)
	(at package10 s5)
	(at package11 s1)
	(at package12 s7)
	(at package13 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 34)
	(= (time-to-drive s2 s0) 34)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 17)
	(= (time-to-drive s5 s0) 17)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 36)
	(= (time-to-drive s7 s0) 36)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 5)
	(= (time-to-drive s8 s0) 5)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 39)
	(= (time-to-drive s2 s1) 39)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 89)
	(= (time-to-drive s7 s1) 89)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 54)
	(= (time-to-drive s3 s2) 54)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 57)
	(= (time-to-drive s7 s3) 57)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 15)
	(= (time-to-drive s2 s4) 15)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 87)
	(= (time-to-drive s8 s4) 87)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 16)
	(= (time-to-drive s1 s5) 16)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 39)
	(= (time-to-drive s3 s5) 39)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 83)
	(= (time-to-drive s6 s5) 83)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 56)
	(= (time-to-drive s8 s5) 56)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 84)
	(= (time-to-drive s0 s6) 84)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 10)
	(= (time-to-drive s1 s6) 10)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 53)
	(= (time-to-drive s4 s6) 53)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 63)
	(= (time-to-drive s5 s7) 63)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 94)
	(= (time-to-drive s9 s7) 94)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 63)
	(= (time-to-drive s2 s8) 63)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 83)
	(= (time-to-drive s3 s8) 83)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 94)
	(= (time-to-drive s9 s8) 94)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 73)
	(= (time-to-drive s5 s9) 73)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s2)
	(at truck1 s2)
	(at truck3 s0)
	(at package1 s3)
	(at package2 s1)
	(at package3 s9)
	(at package4 s7)
	(at package5 s6)
	(at package6 s9)
	(at package7 s4)
	(at package8 s8)
	(at package9 s5)
	(at package10 s1)
	(at package11 s9)
	(at package12 s3)
	(at package13 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s4 p3-4)
   deleted: (at driver3 s4)
   added: (at driver3 p3-4)
   goals met: 1 of 17
2. (walk driver3 p3-4 s3)
   deleted: (at driver3 p3-4)
   added: (at driver3 s3)
   goals met: 1 of 17
3. (load-truck package2 truck1 s3)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 17
4. (load-truck package9 truck1 s3)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 17
5. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 17
6. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 702
   goals met: 2 of 17
7. (walk driver2 s2 p2-5)
   deleted: (at driver2 s2)
   added: (at driver2 p2-5)
   goals met: 2 of 17
8. (walk driver2 p2-5 s5)
   deleted: (at driver2 p2-5)
   added: (at driver2 s5)
   goals met: 2 of 17
9. (load-truck package10 truck3 s5)
   deleted: (at package10 s5)
   added: (in package10 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 17
10. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 17
11. (drive-truck truck3 s5 s7 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 702 to 1395
   goals met: 2 of 17
12. (load-truck package3 truck3 s7)
   deleted: (at package3 s7)
   added: (in package3 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 17
13. (load-truck package6 truck3 s7)
   deleted: (at package6 s7)
   added: (in package6 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 2 of 17
14. (load-truck package12 truck3 s7)
   deleted: (at package12 s7)
   added: (in package12 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 2 of 17
15. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 3 of 17
16. (drive-truck truck3 s7 s9 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   changed: (fuel-used) from 1395 to 3275
   goals met: 3 of 17
17. (drive-truck truck3 s9 s5 driver2)
   deleted: (at truck3 s9)
   added: (at truck3 s5)
   changed: (fuel-used) from 3275 to 4735
   goals met: 3 of 17
18. (drive-truck truck3 s5 s6 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 4735 to 6395
   goals met: 3 of 17
19. (unload-truck package9 truck1 s2)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 3 of 17
20. (drive-truck truck3 s6 s4 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (fuel-used) from 6395 to 7455
   goals met: 3 of 17
21. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 17
22. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 7455 to 7755
   goals met: 3 of 17
23. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   changed: (load truck3) from 4 to 5, (fuel-per-minute truck3) from 20 to 25
   goals met: 3 of 17
24. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 7755 to 9105
   goals met: 3 of 17
25. (unload-truck package12 truck3 s3)
   deleted: (in package12 truck3)
   added: (at package12 s3)
   changed: (load truck3) from 5 to 4, (fuel-per-minute truck3) from 25 to 20
   goals met: 4 of 17
26. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 9105 to 10185
   goals met: 4 of 17
27. (load-truck package9 truck3 s2)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   changed: (load truck3) from 4 to 5, (fuel-per-minute truck3) from 20 to 25
   goals met: 4 of 17
28. (drive-truck truck3 s2 s4 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 10185 to 10560
   goals met: 4 of 17
29. (drive-truck truck3 s4 s6 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (fuel-used) from 10560 to 11885
   goals met: 4 of 17
30. (load-truck package8 truck3 s6)
   deleted: (at package8 s6)
   added: (in package8 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 4 of 17
31. (drive-truck truck3 s6 s5 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 11885 to 14458
   goals met: 4 of 17
32. (unload-truck package9 truck3 s5)
   deleted: (in package9 truck3)
   added: (at package9 s5)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 5 of 17
33. (drive-truck truck3 s5 s1 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 14458 to 14858
   goals met: 5 of 17
34. (load-truck package13 truck3 s1)
   deleted: (at package13 s1)
   added: (in package13 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 5 of 17
35. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 6 of 17
36. (unload-truck package10 truck3 s1)
   deleted: (in package10 truck3)
   added: (at package10 s1)
   changed: (load truck3) from 5 to 4, (fuel-per-minute truck3) from 25 to 20
   goals met: 7 of 17
37. (load-truck package11 truck3 s1)
   deleted: (at package11 s1)
   added: (in package11 truck3)
   changed: (load truck3) from 4 to 5, (fuel-per-minute truck3) from 20 to 25
   goals met: 7 of 17
38. (drive-truck truck3 s1 s5 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 14858 to 15258
   goals met: 7 of 17
39. (drive-truck truck3 s5 s8 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (fuel-used) from 15258 to 16658
   goals met: 7 of 17
40. (unload-truck package8 truck3 s8)
   deleted: (in package8 truck3)
   added: (at package8 s8)
   changed: (load truck3) from 5 to 4, (fuel-per-minute truck3) from 25 to 20
   goals met: 8 of 17
41. (load-truck package1 truck3 s8)
   deleted: (at package1 s8)
   added: (in package1 truck3)
   changed: (load truck3) from 4 to 5, (fuel-per-minute truck3) from 20 to 25
   goals met: 8 of 17
42. (load-truck package5 truck3 s8)
   deleted: (at package5 s8)
   added: (in package5 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 8 of 17
43. (load-truck package7 truck3 s8)
   deleted: (at package7 s8)
   added: (in package7 truck3)
   changed: (load truck3) from 6 to 7, (fuel-per-minute truck3) from 31 to 38
   goals met: 8 of 17
44. (drive-truck truck3 s8 s0 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (fuel-used) from 16658 to 16848
   goals met: 9 of 17
45. (unload-truck package13 truck3 s0)
   deleted: (in package13 truck3)
   added: (at package13 s0)
   changed: (load truck3) from 7 to 6, (fuel-per-minute truck3) from 38 to 31
   goals met: 10 of 17
46. (drive-truck truck3 s0 s6 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 16848 to 19452
   goals met: 9 of 17
47. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 10 of 17
48. (drive-truck truck3 s6 s4 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (fuel-used) from 19452 to 20777
   goals met: 10 of 17
49. (unload-truck package7 truck3 s4)
   deleted: (in package7 truck3)
   added: (at package7 s4)
   changed: (load truck3) from 5 to 4, (fuel-per-minute truck3) from 25 to 20
   goals met: 11 of 17
50. (drive-truck truck3 s4 s8 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s8)
   changed: (fuel-used) from 20777 to 22517
   goals met: 11 of 17
51. (drive-truck truck3 s8 s9 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   changed: (fuel-used) from 22517 to 24397
   goals met: 11 of 17
52. (unload-truck package3 truck3 s9)
   deleted: (in package3 truck3)
   added: (at package3 s9)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 12 of 17
53. (unload-truck package6 truck3 s9)
   deleted: (in package6 truck3)
   added: (at package6 s9)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 13 of 17
54. (unload-truck package11 truck3 s9)
   deleted: (in package11 truck3)
   added: (at package11 s9)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 14 of 17
55. (drive-truck truck3 s9 s8 driver2)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 24397 to 25431
   goals met: 14 of 17
56. (drive-truck truck3 s8 s3 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   changed: (fuel-used) from 25431 to 26344
   goals met: 14 of 17
57. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 15 of 17
58. (drive-truck truck3 s3 s8 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (fuel-used) from 26344 to 27174
   goals met: 15 of 17
59. (disembark-truck driver2 truck3 s8)
   deleted: (driving driver2 truck3)
   added: (at driver2 s8) (empty truck3)
   goals met: 15 of 17
60. (walk driver1 s8 p6-8)
   deleted: (at driver1 s8)
   added: (at driver1 p6-8)
   goals met: 15 of 17
61. (walk driver1 p6-8 s6)
   deleted: (at driver1 p6-8)
   added: (at driver1 s6)
   goals met: 15 of 17
62. (walk driver1 s6 p6-1)
   deleted: (at driver1 s6)
   added: (at driver1 p6-1)
   goals met: 15 of 17
63. (walk driver1 p6-1 s1)
   deleted: (at driver1 p6-1)
   added: (at driver1 s1)
   goals met: 16 of 17
64. (board-truck driver2 truck3 s8)
   deleted: (at driver2 s8) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 16 of 17
65. (drive-truck truck3 s8 s0 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (fuel-used) from 27174 to 27224
   goals met: 17 of 17
